In [1]:
import pandas as pd

In [2]:
friends = [
        ['name', ['beom', 'seek', 'wan']],
        ['age', [28,27,29]],
        ['job', ['student', 'programmer','master']]
]

df = pd.DataFrame.from_items(friends)
df

   name  age         job
0  beom   28     student
1  seek   27  programmer
2   wan   29      master

In [3]:
df[:2]

   name  age         job
0  beom   28     student
1  seek   27  programmer

index location

In [4]:
df.loc[[0,2]]

   name  age      job
0  beom   28  student
2   wan   29   master

## 조건에 따른 속성 값 얻기

In [5]:
df[df.age>28]

  name  age     job
2  wan   29  master

In [6]:
df.query('age > 28')

  name  age     job
2  wan   29  master

논리적 조건사용

In [7]:
df[(df.name == 'wan') | (df.age > 27)]

   name  age      job
0  beom   28  student
2   wan   29   master

## Column을 필터하기

In [8]:
friends_list = [
    ['beom', 28, 'student'],
    ['seek',27,'programmer'],
    ['wan', 29,'master']
]

In [9]:
#df = pd.DataFrame(friends_list, columns = ['name', 'age', 'job'])
df = pd.DataFrame(friends_list)
df

      0   1           2
0  beom  28     student
1  seek  27  programmer
2   wan  29      master

iloc[row, col]

In [10]:
df.iloc[:,:2]

      0   1
0  beom  28
1  seek  27
2   wan  29

## column name을 사용하여 사용

In [11]:
df = pd.read_csv('friends.csv')
df

   name  age      job
0  beom   28  student
1  seek   27  default
2   wan   28   master

In [12]:
df[['name', 'job']]

   name      job
0  beom  student
1  seek  default
2   wan   master

filter 기능 사용

In [13]:
df.filter(items = ['age', 'job'])

   age      job
0   28  student
1   27  default
2   28   master

In [14]:
df.filter(like = 'a', axis = 1) # column이름에 'a'가 들어간 것만 선택

   name  age
0  beom   28
1  seek   27
2   wan   28

In [15]:
df.filter(regex = 'e$', axis = 1) # column이름이 'e'로 끝나는 것만 선택

   name  age
0  beom   28
1  seek   27
2   wan   28

# Drop row or column

index number로 drop

In [16]:
df.drop(1)

   name  age      job
0  beom   28  student
2   wan   28   master

하지만 df자체는 변하지 않는다.

In [17]:
df

   name  age      job
0  beom   28  student
1  seek   27  default
2   wan   28   master

In [18]:
df = df.drop(['job'],axis=1) # axis = 1 이라는 의미는 column중에서 라는 의미
df

   name  age
0  beom   28
1  seek   27
2   wan   28

In [19]:
df = pd.read_csv('friends.csv')
df

   name  age      job
0  beom   28  student
1  seek   27  default
2   wan   28   master

inplace를 True로 설정한다면 바로 적용이 된다.

In [20]:
df.drop(['job'],axis=1, inplace = True)
df

   name  age
0  beom   28
1  seek   27
2   wan   28

In [21]:
df.drop(1, inplace = True)
df

   name  age
0  beom   28
2   wan   28

In [22]:
df = pd.read_csv('friends.csv')
df

   name  age      job
0  beom   28  student
1  seek   27  default
2   wan   28   master